In [1]:
import pandas as pd

In [2]:
data = {'a':[1,2,3,4],
       'b':[4,5,6,7],
       'c':['ra','ka','ga','ca']}

In [10]:
df = pd.DataFrame(data)
df

   a  b   c
0  1  4  ra
1  2  5  ka
2  3  6  ga
3  4  7  ca

In [11]:
df.set_index('c',inplace=True)
df

    a  b
c
ra  1  4
ka  2  5
ga  3  6
ca  4  7

In [12]:
df.reset_index(inplace = True)
df

    c  a  b
0  ra  1  4
1  ka  2  5
2  ga  3  6
3  ca  4  7

In [14]:
data = {'a':[1,2,3,4],
       'b':[4,5,6,7],
       'c':['ra','ka','ga','ca']}
df2 = pd.DataFrame(data,index=['a','b','c','d'])
df2

   a  b   c
a  1  4  ra
b  2  5  ka
c  3  6  ga
d  4  7  ca

In [18]:
df2.reindex(['b','c','a','d'])# just sort the values as provided in reindex

   a  b   c
b  2  5  ka
c  3  6  ga
a  1  4  ra
d  4  7  ca

In [22]:
#iterate over rows
for i in df2.iterrows():
    print(i)

('a', a     1
b     4
c    ra
Name: a, dtype: object)
('b', a     2
b     5
c    ka
Name: b, dtype: object)
('c', a     3
b     6
c    ga
Name: c, dtype: object)
('d', a     4
b     7
c    ca
Name: d, dtype: object)

In [23]:
for i in df2.iteritems():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a    ra
b    ka
c    ga
d    ca
Name: c, dtype: object)

/tmp/ipykernel_1566/2236552044.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df2.iteritems():

In [26]:
def test(x):
    return x.sum()
df2.apply(test,axis=0)

a          10
b          22
c    rakagaca
dtype: object

In [27]:
df3 = df2[['a','b']]

In [28]:
#apply map will apply the function on all items of df not just a column
df3.applymap(lambda x: x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [30]:
#sort values
df2.sort_values('c')

   a  b   c
d  4  7  ca
c  3  6  ga
b  2  5  ka
a  1  4  ra

In [31]:
df2.sort_index(ascending = False)

   a  b   c
d  4  7  ca
c  3  6  ga
b  2  5  ka
a  1  4  ra

In [36]:
df4 = pd.DataFrame({'desc': ['In this Python tutorial, I will show you exactly how to get the day of the week of a given date. For example, you want to find out the day’s name or number from the datetime.In this datetime guide, I’ll cover:weekday() method to get the day of the week as a number, where Monday is 0 and Sunday is 6isoweekday() method to get the weekday of a given date as an integer, where Monday is 1 and Sunday is 7.strftime() method to get the name of the day from the date. Like Monday, Tuesday.','I am learning DS','how are you?']})

In [37]:
df4

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   desc
0  In this Python tutorial, I will show you exactly how to get the day of the week of a given date. For example, you want to find out the day’s name or number from the datetime.In this datetime guide, I’ll cover:weekday() method to get the day of the week as a number, where Monday is 0 and Sunday is 6isoweekday() method to get the weekday of a given date as an integer, where Monday is 1 and Sunday is 7.strftime() method to get the name of the day from the date. Like Monday, Tuesday.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      I am learning DS
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          how are you?

In [38]:
# to show trucated words
pd.set_option('display.max_colwidth', 1000)
df4

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   desc
0  In this Python tutorial, I will show you exactly how to get the day of the week of a given date. For example, you want to find out the day’s name or number from the datetime.In this datetime guide, I’ll cover:weekday() method to get the day of the week as a number, where Monday is 0 and Sunday is 6isoweekday() method to get the weekday of a given date as an integer, where Monday is 1 and Sunday is 7.strftime() method to get the name of the day from the date. Like Monday, Tuesday.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      I am learning DS
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          how are you?

In [44]:
#calculate len and number of words in a string
df4['len'] = df4['desc'].apply(len)
df4['#words'] = df4['desc'].apply(lambda x: len(x.split()))
df4

,desc,len,#words
0,"In this Python tutorial, I will show you exactly how to get the day of the week of a given date. For example, you want to find out the day’s name or number from the datetime.In this datetime guide, I’ll cover:weekday() method to get the day of the week as a number, where Monday is 0 and Sunday is 6isoweekday() method to get the weekday of a given date as an integer, where Monday is 1 and Sunday is 7.strftime() method to get the name of the day from the date. Like Monday, Tuesday.",484,94
1,I am learning DS,16,4
2,how are you?,12,3

In [48]:
df2
df['a'].mean(),df['a'].median(),df['a'].mode(),df['a'].std(),df['a'].var()

(2.5,
 2.5,
 0    1
 1    2
 2    3
 3    4
 Name: a, dtype: int64,
 1.2909944487358056,
 1.6666666666666667)

In [49]:
df['a'].min(),df['a'].max(), df['a'].sum(), df['a'].var()

(1, 4, 10, 1.6666666666666667)

In [50]:
df4=pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9,10]})
df4

    a
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [52]:
#window average
df4.rolling(window=2).mean()
df4.rolling(window=3).mean()

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0
9  9.0

In [56]:
df4.rolling(window=3).min()
df4.rolling(window=3).sum()

      a
0   NaN
1   NaN
2   6.0
3   9.0
4  12.0
5  15.0
6  18.0
7  21.0
8  24.0
9  27.0

In [55]:
#windowsum - if null, value = 0
df4.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45
9  55

In [59]:
#date functionality
#date range like range, arange
date = pd.date_range(start='2023-02-01', end='2023-03-01')

In [61]:
df_date = pd.DataFrame({'date':date})
df_date.head()

        date
0 2023-02-01
1 2023-02-02
2 2023-02-03
3 2023-02-04
4 2023-02-05

In [63]:
df_date.dtypes

date    datetime64[ns]
dtype: object

In [64]:
df7=pd.DataFrame({'date':['2023-02-01','2023-02-02','2023-02-03']})
df7.head(),df7.dtypes

(         date
 0  2023-02-01
 1  2023-02-02
 2  2023-02-03,
 date    object
 dtype: object)

In [66]:
#to convert string to datetime format
df7['std_date'] = pd.to_datetime(df7['date'])
df7,df7.dtypes

(         date   std_date
 0  2023-02-01 2023-02-01
 1  2023-02-02 2023-02-02
 2  2023-02-03 2023-02-03,
 date                object
 std_date    datetime64[ns]
 dtype: object)

In [67]:
df7['year'] = df7['std_date'].dt.year
df7['month'] = df7['std_date'].dt.month
df7['day'] = df7['std_date'].dt.day
df7

         date   std_date  year  month  day
0  2023-02-01 2023-02-01  2023      2    1
1  2023-02-02 2023-02-02  2023      2    2
2  2023-02-03 2023-02-03  2023      2    3

In [81]:
df7[1:2]
df7.iloc[1:2]
df7.iloc[[1]]
df7.iloc[[0,2]]

         date   std_date  year  month  day
0  2023-02-01 2023-02-01  2023      2    1
2  2023-02-03 2023-02-03  2023      2    3

In [68]:
#time delta
time = pd.Timedelta(days=1,hours=5,minutes=55)
time

Timedelta('1 days 05:55:00')

In [69]:
dt = pd.to_datetime('2022-06-20')
dt+time

Timestamp('2022-06-21 05:55:00')

In [70]:
#value_counts

In [94]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [83]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.240336  0.356215  0.976186  0.871984  0.232049  0.971281
2  0.932790  0.337706  0.792166  0.612679  0.066822  0.626714
3  0.577797  0.559537  0.688676  0.376566  0.038727  0.383146
4  0.450364  0.472335  0.579728  0.995198  0.395461  0.817318
5  0.197082  0.439167  0.608230  0.936391  0.550754  0.873826
6  0.932336  0.759055  0.879181  0.852451  0.216531  0.719141

In [84]:
df1.mean()

column_1    0.555117
column_2    0.487336
column_3    0.754028
column_4    0.774212
column_5    0.250057
column_6    0.731904
dtype: float64

In [86]:
df1.std(), df1['column_2'].std()

(column_1    0.323634
 column_2    0.155674
 column_3    0.156448
 column_4    0.234535
 column_5    0.195573
 column_6    0.208614
 dtype: float64,
 0.1556735246159439)

In [95]:
df1.loc[2,'column_2'] = 'str'

In [96]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.534170  0.425463  0.640710  0.949343  0.670002  0.342503
2  0.027423       str  0.210523  0.262792  0.532204  0.674021
3  0.968858  0.820876  0.960834  0.628154  0.373783  0.145351
4  0.158494  0.088272  0.655421  0.653583  0.371207  0.492355
5  0.687685  0.406774  0.041290  0.080961  0.476232  0.739081
6  0.024269  0.484122  0.659020  0.070129  0.279451  0.421209

In [98]:
df1.mean()

/tmp/ipykernel_1566/4177819254.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean(), #df1['column_2'].mean()

(column_1    0.400150
 column_3    0.527966
 column_4    0.440827
 column_5    0.450480
 column_6    0.469087
 dtype: float64,)

In [1]:
#df1['column_2'].mean()

In [8]:
from datetime import date

today = date.today()
current_date = today.day
current_month = today.month
current_year = today.year
current_date, current_month, current_year

(5, 3, 2023)

In [17]:
print(today)

2023-03-05

In [19]:
import pandas as pd
#dt2 = pd.date_range(start='2023-03-02',end='2023-03-03')
start = pd.to_datetime(input('Enter Start Date: '))
end = pd.to_datetime(input('Enter end Date: '))
diff = pd.Timedelta(end - start,'h')
print('Date diff is {}'.format(diff))

Enter Start Date:  2023-03-04
Enter end Date:  2023-03-09

Date diff is 5 days 00:00:00

In [24]:
dt2 = pd.date_range(start='2023-03-02',end='2023-03-03')
dt3 = dt2[1] + pd.Timedelta(hours=5)

In [25]:
dt3-dt2[0]

Timedelta('1 days 05:00:00')